In [5]:
import numpy as np
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [3]:
temp_db = create_engine('sqlite:///:memory:')

In [8]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [9]:
df.to_sql(name='new_table',con=temp_db)

4

In [10]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [11]:
new_df

   index   a   b   c   d
0      0  13  12  53  91
1      1  19  16  31  42
2      2  71  51  51  95
3      3  69  71  75  24

In [13]:
res = pd.read_sql_query(sql='SELECT a,c FROM new_table', con=temp_db)

In [14]:
res

    a   c
0  13  53
1  19  31
2  71  51
3  69  75